---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.OnlyMonolithicStairs
source: html/7a6cd742-5d6d-9406-3621-cb34f9e5653b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.OnlyMonolithicStairs Property

Tread thickness can't be zero for non-monolithic stairs

## Syntax (C#)
```csharp
public static FailureDefinitionId OnlyMonolithicStairs { get; }
```